In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("gapminder.csv")
df.head(6)

   Unnamed: 0      country  year  population      cont  life_exp       gdp_cap
0          11  Afghanistan  2007  31889923.0      Asia    43.828    974.580338
1          23      Albania  2007   3600523.0    Europe    76.423   5937.029526
2          35      Algeria  2007  33333216.0    Africa    72.301   6223.367465
3          47       Angola  2007  12420476.0    Africa    42.731   4797.231267
4          59    Argentina  2007  40301927.0  Americas    75.320  12779.379640
5          71    Australia  2007  20434176.0   Oceania    81.235  34435.367440

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  142 non-null    int64
 1   country     142 non-null    object
 2   year        142 non-null    int64
 3   population  142 non-null    float64
 4   cont        142 non-null    object
 5   life_exp    142 non-null    float64
 6   gdp_cap     142 non-null    float64
dtypes: float64(3), int64(2), object(2)
memory usage: 7.9+ KB

In [5]:
df.describe()

        Unnamed: 0    year    population    life_exp       gdp_cap
count   142.000000   142.0  1.420000e+02  142.000000    142.000000
mean    857.000000  2007.0  4.402122e+07   67.007423  11680.071820
std     493.631441     0.0  1.476214e+08   12.073021  12859.937337
min      11.000000  2007.0  1.995790e+05   39.613000    277.551859
25%     434.000000  2007.0  4.508034e+06   57.160250   1624.842248
50%     857.000000  2007.0  1.051753e+07   71.935500   6124.371108
75%    1280.000000  2007.0  3.121004e+07   76.413250  18008.835640
max    1703.000000  2007.0  1.318683e+09   82.603000  49357.190170

In [8]:
df[df.life_exp==df.life_exp.max()]

    Unnamed: 0 country  year   population  cont  life_exp      gdp_cap
66         803   Japan  2007  127467972.0  Asia    82.603  31656.06806

In [13]:
cont_wise = df.groupby('cont')
cont_wise

In [14]:
cont_wise.life_exp.max()

cont
Africa      76.442
Americas    80.653
Asia        82.603
Europe      81.757
Oceania     81.235
Name: life_exp, dtype: float64

In [20]:
cont_wise[["life_exp","population","gdp_cap","country"]].max()

          life_exp    population      gdp_cap         country
cont
Africa      76.442  1.350312e+08  13206.48452        Zimbabwe
Americas    80.653  3.011399e+08  42951.65309       Venezuela
Asia        82.603  1.318683e+09  47306.98978     Yemen, Rep.
Europe      81.757  8.240100e+07  49357.19017  United Kingdom
Oceania     81.235  2.043418e+07  34435.36744     New Zealand

In [19]:
cont_wise[["life_exp","population","gdp_cap"]].mean()

           life_exp    population       gdp_cap
cont
Africa    54.806038  1.787576e+07   3089.032605
Americas  73.608120  3.595485e+07  11003.031625
Asia      70.728485  1.155138e+08  12473.026870
Europe    77.648600  1.953662e+07  25054.481636
Oceania   80.719500  1.227497e+07  29810.188275

# Agg() Method

In [21]:
cont_wise.agg({"life_exp":"mean"})

           life_exp
cont
Africa    54.806038
Americas  73.608120
Asia      70.728485
Europe    77.648600
Oceania   80.719500

In [22]:
cont_wise.agg({"life_exp":["min","max","mean"]})

         life_exp
              min     max       mean
cont
Africa     39.613  76.442  54.806038
Americas   60.916  80.653  73.608120
Asia       43.828  82.603  70.728485
Europe     71.777  81.757  77.648600
Oceania    80.204  81.235  80.719500

In [26]:
cont_wise.agg({"life_exp": ["min", "max", "mean"],"population":["max","mean"]}).sort_index(ascending=False)

         life_exp                       population
              min     max       mean           max          mean
cont
Oceania    80.204  81.235  80.719500  2.043418e+07  1.227497e+07
Europe     71.777  81.757  77.648600  8.240100e+07  1.953662e+07
Asia       43.828  82.603  70.728485  1.318683e+09  1.155138e+08
Americas   60.916  80.653  73.608120  3.011399e+08  3.595485e+07
Africa     39.613  76.442  54.806038  1.350312e+08  1.787576e+07

In [31]:
cont_wise.agg({"life_exp": ["min", "max", "mean"],"population":["max","mean"]}).sort_values(by=('population','max'),ascending=False)

         life_exp                       population
              min     max       mean           max          mean
cont
Asia       43.828  82.603  70.728485  1.318683e+09  1.155138e+08
Americas   60.916  80.653  73.608120  3.011399e+08  3.595485e+07
Africa     39.613  76.442  54.806038  1.350312e+08  1.787576e+07
Europe     71.777  81.757  77.648600  8.240100e+07  1.953662e+07
Oceania    80.204  81.235  80.719500  2.043418e+07  1.227497e+07

# Order by multiple columns

In [32]:
orders_data = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
    'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
orders_data

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [35]:
orders_data.groupby("salesman_id").agg({'purch_amt':'sum'})

             purch_amt
salesman_id
5001          11271.46
5002           1349.45
5003           2590.90
5005            270.65
5006           1983.43
5007             75.29

In [41]:
orders_data.groupby(["salesman_id","customer_id"]).agg({'purch_amt':['sum','mean']}).sort_values(('purch_amt','sum'))

                        purch_amt
                              sum         mean
salesman_id customer_id
5007        3003            75.29    75.290000
5002        3008           250.45   250.450000
5005        3001           270.65   270.650000
5002        3005          1099.00   549.500000
5006        3004          1983.43  1983.430000
5001        3007          2400.60  2400.600000
5003        3009          2590.90  1295.450000
5001        3002          8870.86  2956.953333

# Pandas Grouping and Aggregating Exercises
Exercises from w3resources about grouping and aggregating.

### Group by specific column
Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object

In [4]:
# 1
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df.groupby(['school_code'])

### Group by column and get min, max and mean
Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school

In [5]:
# 2
df.groupby(['school_code']).agg({'age':['mean','min','max']})

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

### Group by two columns
Write a Pandas program to split the following given dataframe into groups based on school code and class

In [6]:
# 3
df.groupby(['school_code','class'])

### Cast grouping as a list
Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list.

In [9]:
# 4
list(df.groupby(['school_code']))

C:\Users\Coach\AppData\Local\Temp\ipykernel_2692\2739683844.py:2: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  list(df.groupby(['school_code']))

[('s001',
     school_code class            name date_Of_Birth   age  height  weight  \
  S1        s001     V  Alberto Franco     15/05/2002   12     173      35
  S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

      address
  S1  street1
  S4  street1  ),
 ('s002',
     school_code class          name date_Of_Birth   age  height  weight  \
  S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
  S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

      address
  S2  street2
  S5  street2  ),
 ('s003',
     school_code class         name date_Of_Birth   age  height  weight  address
  S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3),
 ('s004',
     school_code class          name date_Of_Birth   age  height  weight  \
  S6        s004    VI  David Parkes     15/09/1997   12     159      32

      address
  S6  street4  )]

### Group by and find size of groups
Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data

In [10]:
# 5
df.groupby(['school_code','class']).size()

school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

### Group by two columns and call a specific group
Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group

In [12]:
# 6
df.groupby(['school_code','class']).get_group(('s001','V'))

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1

### Group by column, get min, max min
Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id)

In [16]:
# 7
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
    'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
df.groupby(['customer_id']).agg({'purch_amt':["min",'max','mean']})

            purch_amt
                  min      max         mean
customer_id
3001           270.65   270.65   270.650000
3002            65.26  5760.00  2956.953333
3003            75.29    75.29    75.290000
3004          1983.43  1983.43  1983.430000
3005           150.50   948.50   549.500000
3007          2400.60  2400.60  2400.600000
3008           250.45   250.45   250.450000
3009           110.50  2480.40  1295.450000

### Group by and count each row
Write a Pandas program to split a dataset to group by two columns and count by each row.

In [19]:
# 8
df.groupby(['salesman_id','customer_id']).size()

salesman_id  customer_id
5001         3002           3
             3007           1
5002         3005           2
             3008           1
5003         3009           2
5005         3001           1
5006         3004           1
5007         3003           1
dtype: int64

### Group by two columns, then sort aggregated results
Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups

In [21]:
# 9
df.groupby(['salesman_id','customer_id']).agg({'purch_amt':'sum'}).sort_values(('purch_amt'),ascending=False)

                         purch_amt
salesman_id customer_id
5001        3002           8870.86
5003        3009           2590.90
5001        3007           2400.60
5006        3004           1983.43
5002        3005           1099.00
5005        3001            270.65
5002        3008            250.45
5007        3003             75.29

### Group by column, create list for each group
Write a Pandas program to split the following dataframe into groups based on customer id and create a list of order date for each group

In [22]:
# 10
df.groupby(['customer_id'])['ord_date'].apply(list)

customer_id
3001                            [2012-09-10]
3002    [2012-10-05, 2012-09-10, 2012-04-25]
3003                            [2012-08-17]
3004                            [2012-10-10]
3005                [2012-10-05, 2012-09-10]
3007                            [2012-07-27]
3008                            [2012-06-27]
3009                [2012-08-17, 2012-10-10]
Name: ord_date, dtype: object

### Group by and calculate monthly purchase amount
Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount.

In [30]:
# 11
df['ord_date'] = pd.to_datetime(df['ord_date'])
df.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
# df.groupby(pd.Grouper(key='ord_date',freq='M')).agg({'purch_amt':['sum']})

            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59

### Group by month and year, aggregating totals for both
Write a Pandas program to split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise.

In [38]:
# 12
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
    'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
df['ord_date'] = pd.to_datetime(df['ord_date'])
df.groupby([df['ord_date'].dt.year, df['ord_date'].dt.month]).agg({'purch_amt':sum})

                   purch_amt
ord_date ord_date
2012     4           3045.60
         5            150.50
         7             75.29
         9            270.65
         10         10223.83
2013     5             65.26
         8            110.50
         10           948.50
2014     6            250.45
         7           2400.60

### Group by column with other columns as list
Write a Pandas program to split the following dataframe into groups based on first column and set other column values into a list of values.

In [41]:
# 13
df = pd.DataFrame( {'X' : [10, 10, 10, 20, 30, 30, 10],
                    'Y' : [10, 15, 11, 20, 21, 12, 14],
                    'Z' : [22, 20, 18, 20, 13, 10, 0]})
df.groupby(['X'])['Y','Z'].agg(lambda x:list(x))

C:\Users\Coach\AppData\Local\Temp\ipykernel_2692\3613981559.py:5: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['X'])['Y','Z'].agg(lambda x:list(x))

                   Y                Z
X
10  [10, 15, 11, 14]  [22, 20, 18, 0]
20              [20]             [20]
30          [21, 12]         [13, 10]

### Group by all columns then count groups
Write a Pandas program to split the following dataframe into groups based on all columns and calculate Groupby value counts on the dataframe

In [45]:
# 14
df = pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2],
                    'type' : [10, 15, 11, 20, 21, 12, 14],
                    'book' : ['Math','English','Physics','Math','English','Physics','English']})
df.groupby(['id','type','book']).size().unstack(fill_value=0)

book     English  Math  Physics
id type
1  10          0     1        0
   11          0     0        1
   12          0     0        1
   20          0     1        0
2  14          1     0        0
   15          1     0        0
   21          1     0        0

### Group by column count unique values
Write a Pandas program to split the following dataframe into groups and count unique values of 'value' column.

In [51]:
# 15
df = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})
df.groupby(['value']).nunique()

       id
value
a       3
b       2

### Group by and list all keys in group by object
 Write a Pandas program to split a given dataframe into groups and list all the keys from the GroupBy object.

In [54]:
# 16
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
groups = df.groupby(['school_code'])
print(groups.groups.keys())

dict_keys(['s001', 's002', 's003', 's004'])

### Group by and create new column with counting groups
Write a Pandas program to split a given dataframe into groups and create a new column with count from GroupBy.

In [56]:
# 17
df = pd.DataFrame({
    'book_name':['Book1','Book2','Book3','Book4','Book1','Book2','Book3','Book5'],
    'book_type':['Math','Physics','Computer','Science','Math','Physics','Computer','English'],
    'book_id':[1,2,3,4,1,2,3,5]})
df.groupby(['book_name','book_type']).size().reset_index(name='Count')

  book_name book_type  Count
0     Book1      Math      2
1     Book2   Physics      2
2     Book3  Computer      2
3     Book4   Science      1
4     Book5   English      1

### Group by with bin counts for groups
Write a Pandas program to split a given dataframe into groups with bin counts

In [60]:
# 18
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
    'sales_id':[5002,5003,5004,5003,5002,5001,5005,5007,5008,5004,5005,5001]})
df.groupby(['customer_id', pd.cut(df.sales_id,3)]).size().unstack()

sales_id     (5000.993, 5003.333]  (5003.333, 5005.667]  (5005.667, 5008.0]
customer_id
3001                            1                     0                   0
3002                            1                     2                   0
3003                            0                     1                   0
3004                            0                     0                   1
3005                            2                     0                   0
3007                            1                     0                   0
3008                            0                     1                   0
3009                            1                     0                   1

### Group by 2 columns aggregate for each value
Write a Pandas program to split a given dataframe into groups with multiple aggregations

In [61]:
# 19
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s001'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

df.groupby(['school_code','class']).agg({'height':['mean','min','max'],'age':['mean','min','max']})

                  height             age
                    mean  min  max  mean min max
school_code class
s001        V      173.0  173  173  12.0  12  12
            VI     163.0  159  167  12.5  12  13
s002        V      171.5  151  192  13.0  12  14
s003        VI     186.0  186  186  13.0  13  13

### Group by and display target column as list of unique values
Write a Pandas program to split a given dataframe into groups and display target column as a list of unique values.

In [67]:
# 20
df = pd.DataFrame( {'id' : ['A','A','A','A','A','A','B','B','B','B','B'],
                    'type' : [1,1,1,1,2,2,1,1,1,2,2],
                    'book' : ['Math','Math','English','Physics','Math','English','Physics','English','Physics','English','English']})
df.groupby(['id','type'])['book'].apply(set).apply(list)

id  type
A   1       [Math, English, Physics]
    2                [Math, English]
B   1             [English, Physics]
    2                      [English]
Name: book, dtype: object

### Groups and calculate quarterly purchase amount
Write a Pandas program to split the following dataframe into groups and calculate quarterly purchase amount

In [69]:
# 21
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
    'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
df['ord_date'] = pd.to_datetime(df['ord_date'])
df.groupby(pd.Grouper(key='ord_date',freq='Q')).agg({'purch_amt':sum})

            purch_amt
ord_date
2012-06-30    3511.81
2012-09-30    2857.04
2012-12-31   11172.33

### Group by with aggregate and custom column name for each school
Write a Pandas program to split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school.

In [71]:
# 22
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    ' height ': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df.groupby(['school_code']).agg(min_age = ('age','min'),max_age = ('age','max'),mean_age = ('age','mean'))

             min_age  max_age  mean_age
school_code
s001              12       13      12.5
s002              12       14      13.0
s003              13       13      13.0
s004              12       12      12.0

### Group on customer id and calculate the number of customers starting with 'C', the list of all products and the difference of maximum purchase amount and minimum purchase amount.

In [73]:
# 23
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
    'customer_id':['C3001','C3001','D3005','D3001','C3005','D3001','C3005','D3001','D3005','C3001','D3005','D3005'],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
result = df.groupby(['salesman_id']).agg(customer_id_start_C = ('customer_id', lambda x: (x.str[0] == 'C').sum()),
         customer_id_list = ('customer_id', lambda x: ', '.join(x)),
         purchase_amt_gap   = ('purch_amt', lambda x: x.max()-x.min())
         )
result

             customer_id_start_C            customer_id_list  purchase_amt_gap
salesman_id
5001                           1  D3005, D3001, C3005, D3005           5694.74
5002                           3         C3001, C3005, C3001            798.00
5003                           0                D3001, D3005           2369.90
5005                           1                       C3001              0.00
5006                           0                       D3001              0.00
5007                           0                       D3005              0.00

### Group and summarize and percentage for each group
Write a Pandas program to split the following datasets into groups on customer_id to summarize purch_amt and calculate percentage of purch_amt in each group.

In [79]:
# 24
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
    'customer_id':['C3001','C3001','D3005','D3001','C3005','D3001','C3005','D3001','D3005','C3001','D3005','D3005'],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

gr_data = df.groupby(['customer_id','salesman_id']).agg({'purch_amt': 'sum'})
gr_data["% (Purch Amt.)"] = gr_data.apply(lambda x:  100*x / x.sum())
print(gr_data)

                         purch_amt  % (Purch Amt.)
customer_id salesman_id
C3001       5002            400.95        2.285764
            5005            270.65        1.542941
C3005       5001           5760.00       32.837016
            5002            948.50        5.407276
D3001       5001           2400.60       13.685510
            5003            110.50        0.629946
            5006           1983.43       11.307278
D3005       5001           3110.86       17.734611
            5003           2480.40       14.140440
            5007             75.29        0.429219

### Group by column, aggregate by column and rename aggregations
Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group, also change the column name of the aggregated metric.

In [80]:
# 25
df.groupby(['customer_id']).agg(min_purch = ('purch_amt','min'),max_purch = ('purch_amt','max'),mean_purch = ('purch_amt','mean'))

             min_purch  max_purch   mean_purch
customer_id
C3001           150.50     270.65   223.866667
C3005           948.50    5760.00  3354.250000
D3001           110.50    2400.60  1498.176667
D3005            65.26    3045.60  1416.637500

### Group by two columns and convert other columns to dictionary
Write a Pandas program to split a given dataset, group by two columns and convert other columns of the dataframe into a dictionary with column header as key.

In [88]:
# 26
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

dict_data_list = list()

for gg, dd in df.groupby(['school_code','class']):
    group = dict(zip(['school_code','class'], gg))
    ocolumns_list = list()
    for _, data in dd.iterrows():
        data = data.drop(labels=['school_code','class'])
        ocolumns_list.append(data.to_dict())
    group['other_columns'] = ocolumns_list
    dict_data_list.append(group)

print(dict_data_list)

[{'school_code': 's001', 'class': 'V', 'other_columns': [{'name': 'Alberto Franco', 'date_Of_Birth ': '15/05/2002', 'age': 12, 'height': 173, 'weight': 35, 'address': 'street1'}]}, {'school_code': 's001', 'class': 'VI', 'other_columns': [{'name': 'Eesha Hinton', 'date_Of_Birth ': '25/09/1998', 'age': 13, 'height': 167, 'weight': 30, 'address': 'street1'}]}, {'school_code': 's002', 'class': 'V', 'other_columns': [{'name': 'Gino Mcneill', 'date_Of_Birth ': '17/05/2002', 'age': 12, 'height': 192, 'weight': 32, 'address': 'street2'}, {'name': 'Gino Mcneill', 'date_Of_Birth ': '11/05/2002', 'age': 14, 'height': 151, 'weight': 31, 'address': 'street2'}]}, {'school_code': 's003', 'class': 'VI', 'other_columns': [{'name': 'Ryan Parkes', 'date_Of_Birth ': '16/02/1999', 'age': 13, 'height': 186, 'weight': 33, 'address': 'street3'}]}, {'school_code': 's004', 'class': 'VI', 'other_columns': [{'name': 'David Parkes', 'date_Of_Birth ': '15/09/1997', 'age': 12, 'height': 159, 'weight': 32, 'address': 'street4'}]}]

### Group and apply one aggregate to a few columns, then another to the rest
Write a Pandas program to split a given dataset, group by one column and apply an aggregate function to few columns and another aggregate function to the rest of the columns of the dataframe.

In [89]:
# 27
df = pd.DataFrame({
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001],
    'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6],
    'sale_feb':[250.5, 170.65, 15.26, 110.5, 598.5, 1400.6, 2760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_mar':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_apr':[150.5, 270.65, 95.26, 210.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_may':[130.5, 270.65, 65.26, 310.5, 948.5, 2400.6, 760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_jun':[150.5, 270.65, 45.26, 110.5, 948.5, 3400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_jul':[950.5, 270.65, 65.26, 210.5, 948.5, 2400.6, 5760, 983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_aug':[150.5, 70.65,  65.26, 110.5, 948.5, 400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_sep':[150.5, 270.65, 65.26, 110.5, 948.5, 200.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_oct':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_nov':[150.5, 270.65, 95.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'sale_dec':[150.5, 70.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6]
})

df.groupby(['salesman_id']).agg(lambda x : x.sum() if x.name in ['sale_jan','sale_feb','sale_mar'] else x.mean())

,sale_jan,sale_feb,sale_mar,sale_apr,sale_may,sale_jun,sale_jul,sale_aug,sale_sep,sale_oct,sale_nov,sale_dec
salesman_id,,,,,,,,,,,,
5001,5271.46,7221.46,11271.46,1575.365000,1567.865,3062.865000,2817.865000,2317.865000,2267.865000,2817.865000,2825.365000,2817.865000
5002,2349.45,1099.45,1349.45,449.816667,443.150,449.816667,716.483333,449.816667,449.816667,449.816667,449.816667,449.816667
5003,590.90,2590.90,2590.90,1345.450000,1395.450,1295.450000,1345.450000,1295.450000,1295.450000,1295.450000,1295.450000,1295.450000
5005,270.65,170.65,270.65,270.650000,270.650,270.650000,270.650000,70.650000,270.650000,270.650000,270.650000,70.650000
5006,2983.43,1983.43,1983.43,1983.430000,1983.430,983.430000,983.430000,1983.430000,1983.430000,1983.430000,1983.430000,1983.430000
5007,75.29,75.29,75.29,75.290000,75.290,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000

### Group by column, remove groups if all values are not available
Write a Pandas program to split a given dataset, group by one column and remove those groups if all the values of a specific columns are not available

In [90]:
# 28
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'weight': [173, 192, 186, 167, 151, 159],
    'height': [35, None, 33, 30, None, 32]},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df[(~df['height'].isna()).groupby(df['school_code']).transform('any')]

   school_code class            name date_Of_Birth   age  weight  height
S1        s001     V  Alberto Franco     15/05/2002   12     173    35.0
S3        s003    VI     Ryan Parkes     16/02/1999   13     186    33.0
S4        s001    VI    Eesha Hinton     25/09/1998   13     167    30.0
S6        s004    VI    David Parkes     15/09/1997   12     159    32.0

### Group by column split into two labels and ranges
Write a Pandas program to split a given dataset using group by on specified column into two labels and ranges

In [91]:
# 29
df = pd.DataFrame({
    'salesman_id': [5001,5002,5003,5004,5005,5006,5007,5008,5009,5010,5011,5012],
    'sale_jan':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 1760, 2983.43, 480.4,  1250.45, 75.29,1045.6]})

df.groupby(pd.cut(df['salesman_id'],
                  bins=[0,5006,np.inf],
                  labels=['S1', 'S2']))['sale_jan'].sum().reset_index()

  salesman_id  sale_jan
0          S1   3946.01
1          S2   7595.17

### Group by first column aggregate over multiple lists on second column
Write a Pandas program to split the following dataset using group by on first column and aggregate over multiple lists on second column

In [92]:
# 30
df = pd.DataFrame({
    'student_id': ['S001','S001','S002','S002','S003','S003'],
    'marks': [[88,89,90],[78,81,60],[84,83,91],[84,88,91],[90,89,92],[88,59,90]]})

df.set_index('student_id')['marks'].groupby('student_id').apply(list).apply(lambda x: np.mean(x,0))

student_id
S001    [83.0, 85.0, 75.0]
S002    [84.0, 85.5, 91.0]
S003    [89.0, 74.0, 91.0]
Name: marks, dtype: object

### Group by column and find first date for each group
Write a Pandas program to split the following dataset using group by on 'salesman_id' and find the first order date for each group.

In [93]:
# 31
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
    'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
    'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5004,5003,5002,5004,5001]})
df.groupby('salesman_id')['ord_date'].min()

salesman_id
5001    2012-04-25
5002    2012-06-27
5003    2012-08-17
5004    2012-08-17
5005    2012-09-10
Name: ord_date, dtype: object

### Group by multiple columns and drop last n rows
Write a Pandas program to split a given dataset using group by on multiple columns and drop last n rows of from each group.

In [95]:
# 32
df = pd.DataFrame({
    'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
    'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
    'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
    'customer_id':[3002,3001,3001,3003,3002,3002,3001,3004,3003,3002,3003,3001],
    'salesman_id':[5002,5003,5001,5003,5002,5001,5001,5003,5003,5002,5003,5001]})

df.drop(df.groupby(['salesman_id', 'customer_id']).tail(2).index, axis=0)

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3002         5002
2   70002      65.26  2012-10-05         3001         5001
3   70004     110.50  2012-08-17         3003         5003